# Data Exploration

In [2]:
data={'S.no':[1,2,3,4,5,6,7],
      'Name':['Ram','Sam','Tom','Com','Pom','Lom','Lom'],
      'Age':[23,34,50,43,65,43,21],
      'Product':['Soap','Bands','Radish','Shampoo','Pulses','Grains','Nuts'],
      'Price':[20,30,34,700,360,456,800],
      'Payment':['cash','UPI','cash','UPI','cash','UPI','cash']
}

data

{'S.no': [1, 2, 3, 4, 5, 6, 7],
 'Name': ['Ram', 'Sam', 'Tom', 'Com', 'Pom', 'Lom', 'Lom'],
 'Age': [23, 34, 50, 43, 65, 43, 21],
 'Product': ['Soap', 'Bands', 'Radish', 'Shampoo', 'Pulses', 'Grains', 'Nuts'],
 'Price': [20, 30, 34, 700, 360, 456, 800],
 'Payment': ['cash', 'UPI', 'cash', 'UPI', 'cash', 'UPI', 'cash']}

In [4]:
import pandas as pd
df=pd.DataFrame(data)
df

   S.no Name  Age  Product  Price Payment
0     1  Ram   23     Soap     20    cash
1     2  Sam   34    Bands     30     UPI
2     3  Tom   50   Radish     34    cash
3     4  Com   43  Shampoo    700     UPI
4     5  Pom   65   Pulses    360    cash
5     6  Lom   43   Grains    456     UPI
6     7  Lom   21     Nuts    800    cash

In [7]:
df['City']=['HYD','SEC','HYD','SEC','HYD','SEC','HYD']
df

   S.no Name  Age  Product  Price Payment City
0     1  Ram   23     Soap     20    cash  HYD
1     2  Sam   34    Bands     30     UPI  SEC
2     3  Tom   50   Radish     34    cash  HYD
3     4  Com   43  Shampoo    700     UPI  SEC
4     5  Pom   65   Pulses    360    cash  HYD
5     6  Lom   43   Grains    456     UPI  SEC
6     7  Lom   21     Nuts    800    cash  HYD

# Head

In [ ]:
#shows the first few rows of the dataset
#It gives a quick lookat the data to understand the content

In [8]:
df.head()

   S.no Name  Age  Product  Price Payment City
0     1  Ram   23     Soap     20    cash  HYD
1     2  Sam   34    Bands     30     UPI  SEC
2     3  Tom   50   Radish     34    cash  HYD
3     4  Com   43  Shampoo    700     UPI  SEC
4     5  Pom   65   Pulses    360    cash  HYD

# Tail

In [ ]:
#shows the few rows of the data set
#gives an idea about how the data ends and helps you to understand the size of the dataset

In [9]:
df.tail()

   S.no Name  Age  Product  Price Payment City
2     3  Tom   50   Radish     34    cash  HYD
3     4  Com   43  Shampoo    700     UPI  SEC
4     5  Pom   65   Pulses    360    cash  HYD
5     6  Lom   43   Grains    456     UPI  SEC
6     7  Lom   21     Nuts    800    cash  HYD

# shape

In [11]:
#Tells you the number of rows and columns in a dataset
df.shape

(7, 7)

# Column

In [13]:
#Lists all the column names
#helps you to see what kind of datatypes that a dataset contains
df.columns

Index(['S.no', 'Name', 'Age', 'Product', 'Price', 'Payment', 'City'], dtype='object')

# info

In [14]:
#we can get the whole summary of the data
df.info

<bound method DataFrame.info of    S.no Name  Age  Product  Price Payment City
0     1  Ram   23     Soap     20    cash  HYD
1     2  Sam   34    Bands     30     UPI  SEC
2     3  Tom   50   Radish     34    cash  HYD
3     4  Com   43  Shampoo    700     UPI  SEC
4     5  Pom   65   Pulses    360    cash  HYD
5     6  Lom   43   Grains    456     UPI  SEC
6     7  Lom   21     Nuts    800    cash  HYD>

# Dtypes

In [15]:
#shows the data type of each column
#it makes sure the data types are appropriate
df.dtypes

S.no        int64
Name       object
Age         int64
Product    object
Price       int64
Payment    object
City       object
dtype: object

# describe()

In [16]:
#provides summary of statistics
#gives quick idea of distribution and range of numeric data
df.describe()

           S.no        Age       Price
count  7.000000   7.000000    7.000000
mean   4.000000  39.857143  342.857143
std    2.160247  15.431878  328.414082
min    1.000000  21.000000   20.000000
25%    2.500000  28.500000   32.000000
50%    4.000000  43.000000  360.000000
75%    5.500000  46.500000  578.000000
max    7.000000  65.000000  800.000000

# unique()

In [20]:
# shows the unique values in a column
#helps you to understand the variety od data in a column
df['City'].unique()

array(['HYD', 'SEC'], dtype=object)

# Value Counts

In [22]:
#tells how many times each unique value appears in a column
#helps you spot trends or patterns of your data
df['Product'].value_counts()

Product
Soap       1
Bands      1
Radish     1
Shampoo    1
Pulses     1
Grains     1
Nuts       1
Name: count, dtype: int64